sdaiGetInstanceModel(Sdai_instS*)
\details
Retrieves the identifier of the SDAI model that contains the entity instance.
\param instance [in] An entity instance.
\returns Returns a model instance that contains the entity instance.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiRP_NOPN - Repository is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiMO_NEXS - SDAI-model does not exist.
* sdaiEI_NEXS - Instance does not exist.
* sdaiSY_ERR - Underlying system error.
\code
SdaiAppInstance appInstance138 = ...;
SdaiModel modelFromInstance = sdaiGetInstanceModel(appInstance138); // modelFromInstance == model